import Scrollbar from "@/components/template/Scrollbar";

const AboutPage = async () => {
    return (
        <Scrollbar>
            <div className="flex flex-col justify-center items-center gap-4 bg-surface-0 w-full h-full">
                <span className="font-serif text-3xl italic bold">ліхо...</span>
                <div className="bg-surface-10 p-4 rounded-2xl lg:max-w-[50%]">
                    <p className="mb-2">
                        І шо думаєш я це по боброті душевній кажу блять да ти
                        правий від того шо було сказано хуй залупа член ніхуя не
                        поміняється даже як би я сказав шо полководець римськох
                        імперії захватив македонію помінялось багато а від того
                        шо я зробив ніхуя не помінялось як би мені дали власть
                        яка даже не снилась моєму атцу ніхуя би не помінялось я
                        сточітєльний педік може став з колін і вивів свою сім'ю
                        в люди но чи це хоть шось поніняло б нє а знаєш чого не
                        ти не знаєш а може і знаєш я ж не ти шо б знати те шо ти
                        знаєш но можеш бути впевненим шо я привів би країну дану
                        мені в знак того шо я педік якій єбашить на складі
                        комплектіруючи тротіл для воєного перевороту в нігері
                        куда втік{" "}
                        <a
                            className="text-blue-600 underline"
                            href="https://uk.wikipedia.org/wiki/%D0%91%D0%B0%D1%80%D0%B0%D0%BA_%D0%9E%D0%B1%D0%B0%D0%BC%D0%B0"
                        >
                            барак обама
                        </a>{" "}
                        після позорного вигняння з куби де правив садам хусейн
                        чи він не там правив я чьо ємєля чтолі как сухарік про
                        якого зробив пісню попка той шо майнкравтєр і вообще
                        свег парєнь кста я його колимь дивися де він робив відео
                        про свій сервер в якому проходка була 500 рублєй 500
                        рублєй блять сука я сьогодні говорив з челом який робив
                        в пітєрі на стройці йому дали премію в розмірі 150000
                        рублєй це тобі не хуй да ніхуя но після цього його
                        депортіровали лох блять зізіххіххіхіххіхіхі{" "}
                    </p>
                    <p>
                        но не важно важно те шо я перспективно хуйвий президент
                        україни я блять нахуй я ж не ємеля я канешно попробував
                        б зробити шось єбабельне но з того шо я сьогодні
                        прослухав в аудіо книзі госудярь я ніхуя не зроблю в
                        перший же день мене отпіздять бабкі за те шо педік я їх
                        нахуй казню превселюдно підвісивши за і так обйобану
                        шмоньку прям так як я малював свого сожильце де підвісив
                        його за яйця крюком хз чи тобі скідував но факт того шо
                        я малював це не отміняє того шо я це малював та я і не
                        тільки таку хуйню малював но так і нічого не закінчив
                        так само я і не закінчу жодну справу коли стану
                        государьом хіба якшо я ним стану я введу закон про те шо
                        держави більше не існує тобто анархія і вся країна стане
                        диким степом на якому катували палякі наших козаків
                        героїв вот такіє пірогі
                    </p>
                </div>
            </div>
        </Scrollbar>
    );
};

export default AboutPage;
